{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<t>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "</t>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "ByteLevel",
        "add_prefix_space": true,
        "trim_offsets": true,
        "use_regex": true
      }
    ]
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[CLS]": 0,
      "[SEP]": 1,
      "[PAD]": 2,
      "[MASK]": 3,
      "<s>": 4,
      "</s>": 5,
      "<t>": 6,
      "</t>": 7,
      "¢": 8,
      "¸": 9,
      "º": 10,
      "»": 11,
      "¼": 12,
      "½": 13,
      "¾": 14,
      "ä": 15,
      "å": 16,
      "æ": 17,
      "ç": 18,
      "é": 19,
      "Ġ": 20,
      "Ĥ": 21,
      "Ħ": 22,
      "ĩ": 23,
      "Į": 24,
      "ı": 25,
      "Ĵ": 26,
      "Ķ": 27,
      "ķ": 28,
      "ĸ": 29,
      "Ļ": 30,
      "Ł": 31,
      "ķæ": 32,
      "¢å": 33,
      "¸º": 34,
      "»ķæ": 35,
      "¼é": 36,
      "½ķæ": 37,
      "¾ç": 38,
      "ä¸º": 39,
      "ä½ķæ": 40,
      "æŁ": 41,
      "çĻ": 42,
      "ç»ķæ": 43,
      "Ġä½ķæ": 44,
      "Ĥ¼é": 45,
      "Ħı": 46,
      "ĩæŁ": 47,
      "Įĸ": 48,
      "ĮĩæŁ": 49,
      "Ĵ¢å": 50,
      "¾çĤ¼é": 51,
      "ä¸ºç»ķæ": 52,
      "çĻ¾çĤ¼é": 53,
      "Ġä½ķæĦı": 54,
      "Įĸä¸ºç»ķæ": 55,
      "ĮĩæŁĶ": 56,
      "Ĵ¢åĮĸä¸ºç»ķæ": 57,
      "çĻ¾çĤ¼éĴ¢åĮĸä¸ºç»ķæ": 58,
      "Ġä½ķæĦıçĻ¾çĤ¼éĴ¢åĮĸä¸ºç»ķæ": 59,
      "Ġä½ķæĦıçĻ¾çĤ¼éĴ¢åĮĸä¸ºç»ķæĮĩæŁĶ": 60
    },
    "merges": [
      "ķ æ",
      "¢ å",
      "¸ º",
      "» ķæ",
      "¼ é",
      "½ ķæ",
      "¾ ç",
      "ä ¸º",
      "ä ½ķæ",
      "æ Ł",
      "ç Ļ",
      "ç »ķæ",
      "Ġ ä½ķæ",
      "Ĥ ¼é",
      "Ħ ı",
      "ĩ æŁ",
      "Į ĸ",
      "Į ĩæŁ",
      "Ĵ ¢å",
      "¾ç Ĥ¼é",
      "ä¸º ç»ķæ",
      "çĻ ¾çĤ¼é",
      "Ġä½ķæ Ħı",
      "Įĸ ä¸ºç»ķæ",
      "ĮĩæŁ Ķ",
      "Ĵ¢å Įĸä¸ºç»ķæ",
      "çĻ¾çĤ¼é Ĵ¢åĮĸä¸ºç»ķæ",
      "Ġä½ķæĦı çĻ¾çĤ¼éĴ¢åĮĸä¸ºç»ķæ",
      "Ġä½ķæĦıçĻ¾çĤ¼éĴ¢åĮĸä¸ºç»ķæ ĮĩæŁĶ"
    ]
  }
}